# Brewfile - Homebrew package manifest
# Install: brew bundle install
# Cleanup: brew bundle cleanup

# Taps
# tap "homebrew/cask-fonts"  # Deprecated - fonts now in main cask
tap "bramstein/webfonttools"

# CLI Tools
brew "bash"                 # Bash 5.x (macOS ships with 3.x)
brew "zsh"                  # Z shell
brew "z"                    # Directory jumping
brew "curl"                 # HTTP client
brew "coreutils"          # GNU core utilities
brew "moreutils"          # Additional unix utilities
brew "findutils"          # GNU find, locate, updatedb, xargs
brew "gnu-sed"            # GNU sed
brew "wget"               # Download tool
brew "gnupg"              # GPG for signing commits
brew "vim"                # Text editor
brew "grep"               # GNU grep
brew "openssh"            # SSH
brew "tree"               # Directory tree view
brew "ack"                # Code search
brew "git"                # Version control
brew "git-lfs"            # Git large file storage

# Modern CLI replacements
brew "lsd"                # Modern ls
brew "bat"                # Modern cat
brew "fzf"                # Fuzzy finder
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "ripgrep"            # Fast code search (rg)
brew "fd"                 # Modern find
brew "htop"               # Interactive process viewer
brew "tldr"               # Simplified man pages
brew "tmux"               # Terminal multiplexer
brew "delta"              # Better git diffs

# Development tools
brew "chezmoi"            # Dotfiles manager
brew "gh"                 # GitHub CLI
brew "go"                 # Go language
brew "node"               # Node.js
brew "nvm"                # Node version manager
brew "yarn"               # JS package manager
brew "pnpm"               # Fast JS package manager
brew "shellcheck"         # Shell script linter
brew "terraform"          # Infrastructure as code

# Languages & runtimes
brew "ruby"               # Ruby

# Cloud & DevOps
brew "azure-cli"          # Azure CLI
brew "flyctl"             # Fly.io CLI
brew "graphviz"           # Graph visualization
brew "rclone"             # Sync files to cloud storage (Google Drive, S3, etc.)

# Security
brew "nmap"               # Network scanner
cask "1password-cli"      # 1Password CLI (op) for secrets in dotfiles

# CLI apps
# brew "chatgpt-cli"        # ChatGPT CLI - not available in Homebrew
# brew "gemini-cli"         # Gemini CLI - not available in Homebrew
brew "jira-cli"           # Jira CLI
brew "stripe-cli"         # Stripe CLI
brew "mas"                # Mac App Store CLI
brew "lazygit"            # Terminal UI for git
brew "neovim"             # Modern vim
brew "watch"              # Run commands periodically

# Casks - Development
# cask "visual-studio-code" # VS Code - conflicts_with bug, install manually
# cask "docker"             # Docker - conflicts_with bug, install manually
cask "jetbrains-toolbox"  # JetBrains tools
cask "rider"              # .NET IDE
cask "dotnet-sdk"         # .NET SDK - conflicts_with bug, install manually

# Casks - Terminals
cask "iterm2"             # iTerm2
cask "hyper"              # Hyper terminal
cask "powershell"         # PowerShell

# Casks - Browsers
cask "brave-browser"      # Brave
cask "google-chrome"      # Chrome

# Casks - AI Tools
cask "claude"             # Claude desktop
cask "cursor"             # Cursor IDE

# Casks - Database
cask "dbeaver-community"  # Database tool
# cask "mysqlworkbench"     # MySQL client - download URL broken

# Casks - Productivity
cask "1password"          # Password manager
cask "slack"              # Chat
cask "whatsapp"           # Messaging
cask "notion"             # Notes
cask "postman"            # API testing
cask "rectangle"          # Window management
cask "raycast"            # Spotlight replacement
cask "alt-tab"            # Windows-like alt-tab
cask "discord"            # Chat
# cask "grammarly-desktop"  # Writing assistant - permission issues

# Casks - Utilities
cask "flux-app"           # Screen color
cask "rescuetime"         # Time tracking
cask "spotify"            # Music

# Fonts
cask "font-hack-nerd-font"

# Mac App Store apps (requires: brew install mas)
mas "Line", id: 539883307
