# Brewfile - Homebrew package manifest
# Install: brew bundle install
# Cleanup: brew bundle cleanup

# Taps
# tap "homebrew/cask-fonts"  # Deprecated - fonts now in main cask
tap "bramstein/webfonttools"

# CLI Tools
brew "bash"                 # Bash 5.x (macOS ships with 3.x)
brew "zsh"                  # Z shell
brew "z"                    # Directory jumping
brew "curl"                 # HTTP client
brew "coreutils"          # GNU core utilities
brew "moreutils"          # Additional unix utilities
brew "findutils"          # GNU find, locate, updatedb, xargs
brew "gnu-sed"            # GNU sed
brew "wget"               # Download tool
brew "gnupg"              # GPG for signing commits
brew "vim"                # Text editor
brew "grep"               # GNU grep
brew "openssh"            # SSH
brew "tree"               # Directory tree view
brew "ack"                # Code search
brew "git"                # Version control
brew "git-lfs"            # Git large file storage

# Modern CLI replacements
brew "lsd"                # Modern ls
brew "bat"                # Modern cat
brew "fzf"                # Fuzzy finder
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "ripgrep"            # Fast code search (rg)
brew "fd"                 # Modern find
brew "htop"               # Interactive process viewer
brew "tldr"               # Simplified man pages
brew "tmux"               # Terminal multiplexer
brew "delta"              # Better git diffs

# Development tools
brew "chezmoi"            # Dotfiles manager
brew "gh"                 # GitHub CLI
brew "go"                 # Go language
brew "node"               # Node.js
brew "nvm"                # Node version manager
brew "yarn"               # JS package manager
brew "pnpm"               # Fast JS package manager
brew "shellcheck"         # Shell script linter
brew "terraform"          # Infrastructure as code
brew "direnv"             # Per-directory environment variables
brew "act"                # Run GitHub Actions locally
brew "pre-commit"         # Git pre-commit hooks framework

# Languages & runtimes
brew "ruby"               # Ruby
brew "pyenv"              # Python version manager
brew "poetry"             # Python dependency management

# Cloud & DevOps
brew "azure-cli"          # Azure CLI
brew "awscli"             # AWS CLI
brew "flyctl"             # Fly.io CLI
brew "graphviz"           # Graph visualization
brew "rclone"             # Sync files to cloud storage (Google Drive, S3, etc.)

# Kubernetes
brew "kubectl"            # Kubernetes CLI
brew "k9s"                # Kubernetes TUI
brew "helm"               # Kubernetes package manager

# Security
brew "nmap"               # Network scanner
cask "1password-cli"      # 1Password CLI (op) for secrets in dotfiles

# CLI apps
# brew "chatgpt-cli"        # ChatGPT CLI - not available in Homebrew
brew "gemini-cli"           # Gemini CLI - not available in Homebrew
brew "jira-cli"             # Jira CLI
brew "stripe-cli"           # Stripe CLI
brew "mas"                  # Mac App Store CLI
brew "dockutil"             # Dock management CLI
brew "lazygit"              # Terminal UI for git
brew "neovim"               # Modern vim
brew "watch"                # Run commands periodically
brew "powershell"           # PowerShell CLI

# Media processing
brew "ffmpeg"               # Video processing
brew "imagemagick"          # Image processing

# Casks - Development
cask "visual-studio-code"  # VS Code
cask "docker-desktop"      # Docker Desktop
cask "jetbrains-toolbox"   # JetBrains tools
cask "rider"               # .NET IDE
cask "dotnet-sdk"          # .NET SDK

# Casks - Terminals
cask "iterm2"             # iTerm2
cask "hyper"              # Hyper terminal
cask "wezterm"            # WezTerm terminal
cask "powershell"         # PowerShell

# Casks - Browsers
cask "brave-browser"      # Brave
cask "google-chrome"      # Chrome
cask "firefox"            # Firefox

# Casks - AI Tools
cask "chatgpt"            # ChatGPT desktop
cask "claude"             # Claude desktop
cask "cursor"             # Cursor IDE
cask "claude-code"


# Database
brew "postgresql@16"      # PostgreSQL client
brew "mysql-client"       # MySQL client
brew "redis"              # Redis CLI

# Casks - Database
cask "dbeaver-community"  # Database tool
# cask "mysqlworkbench"     # MySQL client - download URL broken

# Casks - Productivity
cask "1password"          # Password manager
cask "slack"              # Chat
cask "whatsapp"           # Messaging
cask "notion"             # Notes
cask "postman"            # API testing
cask "rectangle"          # Window management
cask "raycast"            # Spotlight replacement
cask "alt-tab"            # Window switcher
cask "discord"            # Chat
cask "grammarly-desktop"  # Writing assistant
cask "wakatime"           # Time tracking

# Casks - Utilities
cask "google-drive"       # Google Drive sync
cask "flux-app"           # Screen color
cask "rescuetime"         # Time tracking
cask "spotify"            # Music


# Fonts
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store apps (requires: brew install mas)
mas "Line", id: 539883307
